Autodesk.Revit.DB.MEPCurve.MEPSystem
The system of the MEP curve.
Remarks: Returns the system of this MEP curve.
If the curve does not belong to any systems, the value will be null.
If the curve belongs to more than one system, the first available value is returned.

Autodesk.Revit.DB.MEPCurve.ReferenceLevel
The reference level of the MEP curve.
Remarks: This property is used to retrieve the reference level of the MEP curve.
If the curve is not in a horizontal plane, this value will be the start point's reference level.

Autodesk.Revit.DB.MEPCurve.LevelOffset
The offset of the MEP curve.
Remarks: This property is used to retrieve the offset of the MEP curve.
If the curve is not in a horizontal plane, this value will be the start point's offset.

Autodesk.Revit.DB.MEPCurve.Diameter
The diameter of the MEP curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the MEP curve's Shape is not round.
Remarks: This property is used to retrieve the diameter of the MEP curve.

Autodesk.Revit.DB.MEPCurve.Height
The height of the MEP curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the MEP curve's Shape is not rectangular.
Remarks: This property is used to retrieve the height of the MEP curve.

Autodesk.Revit.DB.MEPCurve.Width
The width of the MEP curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the MEP curve's shape is not rectangular.
Remarks: This property is used to retrieve the width of the MEP curve.

Autodesk.Revit.DB.MEPCurve.ConnectorManager
The connector manager of this MEP curve.

Autodesk.Revit.DB.MEPCurve
A curve object for duct or pipe blend elements.
Remarks: The curve object is only available in the Autodesk Revit MEP product.